""""
Задание №7
� Напишите программу на Python, которая будет находить
сумму элементов массива из 1000000 целых чисел.
� Пример массива: arr = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, ...]
� Массив должен быть заполнен случайными целыми числами
от 1 до 100.
� При решении задачи нужно использовать многопоточность,
многопроцессорность и асинхронность.
� В каждом решении нужно вывести время выполнения
вычислений."""

import time
import threading
from random import randint

# items = [randint(0, 100) for i in range(1_000_000)]
# result = 0
# for i in items:
#     result += i
# print(f'Сумма массива = {result}')
# print(items)


items = [57, 45, 40, 66, 77, 20, 64, 37, 0, 40, 24, 6, 46, 38, 82, 34, 98, 63, 86, 67, 47, 22, 46, 68, 72, 94, 70, 29,
         89, 47, 85, 51, 57, 79, 71, 97, 1, 77, 58, 21, 31, 32, 37, 39, 87, 43, 25, 41, 2, 36, 40, 7, 12, 47, 41, 82, 5,
         30, 28, 93, 0, 15, 18, 28, 15, 48, 91, 66, 60, 91, 39, 60, 0, 41, 38, 81, 93, 99, 5, 15, 59, 85, 12, 27, 17,
         79, 4, 92, 98, 53, 58, 73, 64, 18, 2, 13, 75, 25, 75, 61, 53, 66, 81, 77, 57, 26, 72, 2, 53, 40, 82, 74, 25,
         96, 25, 67, 9, 10, 15, 11, 61, 72, 59, 32, 85, 78, 100, 61, 67, 27, 7, 86, 8, 44, 22, 63, 25, 30, 97, 44, 85,
         38, 11, 2, 32, 3, 53, 97, 57, 53, 23, 89, 70, 47, 13, 28, 82, 83, 83, 43, 39, 37, 37, 47, 2, 0, 89, 35, 44, 33,
         64, 59, 41, 13, 27, 25, 36, 47, 37, 88, 69, 48, 36, 50, 83, 66, 72, 77, 19, 42, 81, 5, 63, 46, 58, 11, 19, 72,
         34, 74, 11, 21, 56, 48, 36, 48, 61, 56, 66, 74, 76, 11, 1, 79, 63, 35, 75, 87, 75, 46, 15, 71, 25]

start_time = time.time()
res = 0


def summma(nums):
    global res
    for num in nums:
        res += num
    print(f"Сумма = {res}")


threads = []
for i in range(3):
    t = threading.Thread(target=summma, args=(items,))
    threads.append(t)
    t.start()

for t in threads:
    t.join()

print(f"Значение счетчика в финале: {res:_} всего за: {time.time() - start_time:.2f}")
